In [1]:
import mysql.connector as connector
import pandas as pd

In [2]:
connection = connector.connect(user="archie",password="keke")

In [3]:
cursor = connection.cursor()

In [4]:
cursor.execute("use littlelemondb;")

In [29]:
cursor.execute("show tables;")
for i in cursor.fetchall():
    print(i)

('bookings',)
('customers',)
('delivery',)
('employees',)
('menuitems',)
('menus',)
('orders',)

In [25]:
connection.close()

In [14]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO menuitems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary) VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com',70000),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com',65000),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com',50000),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com',45000),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com',40000),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com',35000);"""

#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID,customerid)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1, 1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1, 2),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3, 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4, 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2, 5),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5, 6);"""

#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

#*******************************************************#
# Insert query to populate "customers" table:
#*******************************************************#
insert_customers="""
INSERT INTO customers (customerid, firstname, lastname, phonenumber, email)
VALUES
(1, 'Anna','Iversen','5051234567', 'ai@derp.com'),
(2, 'Joakim', 'Iversen','5053216547', 'ji@derp.com'),
(3, 'Vanessa', 'McCarthy','5057894561', 'vm@derp.com'),
(4, 'Marcos', 'Romero','5054567891', 'mr@derp.com'),
(5, 'Hiroki', 'Yamane','5059571267', 'hy@derp.com'),
(6, 'Diana', 'Pinto', '5056485132', 'dp@derp.com');"""

In [11]:
cursor.execute(insert_menuitems)
connection.commit()

cursor.execute(insert_menu)
connection.commit()

cursor.execute(insert_employees)
connection.commit()

cursor.execute(insert_customers)
connection.commit()

cursor.execute(insert_bookings)
connection.commit()

cursor.execute(insert_orders)
connection.commit()

In [37]:
sqlv = """
create view ordersview as 

select

orderid,
quantity,
billamount as cost

from orders

where 1=1
and quantity > 2;

"""

In [38]:
cursor.execute(sqlv)
connection.commit()

In [47]:
sqlv = """
select

a.customerid,
a.firstname,
a.lastname,
c.orderid,
billamount as cost,
cuisine,
name,
type

from customers as a
left join bookings as b
on a.customerid = b.customerid

left join orders as c
on b.bookingid = c.bookingid

left join menus as d
on c.menuid = d.menuid

left join menuitems as e
on d.itemid = e.itemid

where 1=1
and billamount > 40;

"""

In [48]:
cursor.execute(sqlv)
for i in cursor.fetchall():
    print(i)

(1, 'Anna', 'Iversen', 1, Decimal('86.00'), 'Greek', 'Olives', 'Starters')
(1, 'Anna', 'Iversen', 1, Decimal('86.00'), 'Greek', 'Greek salad', 'Main Courses')
(1, 'Anna', 'Iversen', 1, Decimal('86.00'), 'Greek', 'Greek yoghurt', 'Desserts')
(1, 'Anna', 'Iversen', 1, Decimal('86.00'), 'Greek', 'Athens White wine', 'Drinks')
(5, 'Hiroki', 'Yamane', 5, Decimal('43.00'), 'Greek', 'Olives', 'Starters')
(5, 'Hiroki', 'Yamane', 5, Decimal('43.00'), 'Greek', 'Greek salad', 'Main Courses')
(5, 'Hiroki', 'Yamane', 5, Decimal('43.00'), 'Greek', 'Greek yoghurt', 'Desserts')
(5, 'Hiroki', 'Yamane', 5, Decimal('43.00'), 'Greek', 'Athens White wine', 'Drinks')

In [57]:
sqlv = """
select
cuisine

from menus as a
left join orders as b
on a.menuid = b.menuid

left join bookings as c
on b.bookingid = c.bookingid

where 1=1
and quantity > 1

"""

In [58]:
cursor.execute(sqlv)
for i in cursor.fetchall():
    print(i)

('Greek',)
('Greek',)
('Greek',)
('Greek',)

In [61]:
sqlv = """

create procedure GetMaxQuantity()
begin
select max(quantity) as max_order
from orders;
end

"""

In [62]:
cursor.execute(sqlv)

In [67]:
sqlv = """

create procedure CancelOrder(x int)
begin
delete from orders where 1=1 and orderid = x;
select concat("order ",x," is cancelled") as confirmation;
end

"""

In [68]:
cursor.execute(sqlv)

In [ ]:
(BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID,customerid)

In [31]:
sqlv = """

create procedure CheckBooking(
    in x varchar(45), 
    in y int)
begin

select 
bookingid,
case when bookingid is null then "table is available at that time"
else "table is not available at that time"
end as bookingstatus
from bookings

where 1=1
and bookingslot = x
and tableno = y;

end

"""

In [54]:
sqlv = """

create procedure CheckBooking(
    in x varchar(45), 
    in y int)
begin

select 
case
when exists(select bookingid from bookings where bookingslot=x and tableno=y) = 1 
    then "table is not available at that time"
when exists(select bookingid from bookings where bookingslot=x and tableno=y) = 0 
    then  "table is available at that time"
end as bookingstatus;
end

"""

In [60]:
cursor.execute(sqlv)

In [53]:
cursor.execute("drop procedure CheckBooking")

In [68]:
sqlv = """

create procedure AddValidBooking(
    in tablenum int, 
    in fn varchar(45),
    in ln varchar(45),
    in bookslot varchar(45),
    in empid int,
    in custid int)
begin

start transaction;
set autocommit = 0;

insert into bookings(tableno,guestfirstname,guestlastname,bookingslot,employeeid,customerid)
values
(tablenum,fn,ln,bookslot,empid,custid);

if exists(select bookingid from bookings where bookingslot=bookslot and tableno=tablenum) = 1 then rollback;
else commit;
end if;

if exists(select bookingid from bookings where bookingslot=bookslot and tableno=tablenum) = 1 
    then select "table already booked;booking cancelled" as booking_status;
else select "booking confirmed" as booking_status;
end if;

end

"""

In [69]:
cursor.execute(sqlv)

In [67]:
cursor.execute("drop procedure AddValidBooking")

In [75]:
sql = """

select distinct

a.customerid,
a.firstname,
a.lastname,
a.phonenumber,
a.email,
billamount as cost


from customers as a
left join bookings as b
on a.customerid = b.customerid

left join orders as c
on b.bookingid = c.bookingid

left join menus as d
on c.menuid = d.menuid

left join menuitems as e
on d.itemid = e.itemid

where 1=1
and billamount > 60;


"""

In [76]:
cursor.execute(sql)

In [77]:
for i in cursor.fetchall():
    print(i)

(1, 'Anna', 'Iversen', '5051234567', 'ai@derp.com', Decimal('86.00'))

In [78]:
connection.close()